1ClientData/Client/armFinalMemcacheTests/400_t64.txt
====== SET ======
  100176 requests completed in 1.18 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
1.27% <= 2 milliseconds
33.51% <= 3 milliseconds
87.57% <= 4 milliseconds
99.84% <= 5 milliseconds
99.87% <= 6 milliseconds
99.87% <= 7 milliseconds
99.87% <= 8 milliseconds
99.87% <= 14 milliseconds
99.94% <= 15 milliseconds
99.98% <= 16 milliseconds
100.00% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 204 milliseconds
85111.30 requests per second

====== GET ======
  100064 requests completed in 1.10 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.27% <= 2 milliseconds
0.45% <= 3 milliseconds
62.91% <= 4 milliseconds
99.16% <= 5 milliseconds
99.88% <= 6 milliseconds
100.00% <= 7 milliseconds
90637.68 requests per second


====== SET ======
  100190 requests completed in 1.13 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
0.32% <= 2 milliseconds
3.64% <= 3 milliseconds
83.09% <= 4 milliseconds
99.13% <= 5 milliseconds
99.83% <= 6 milliseconds
99.93% <= 7 milliseconds
99.97% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
88899.73 requests per second

====== GET ======
  100168 requests completed in 1.12 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.31% <= 2 milliseconds
1.78% <= 3 milliseconds
83.25% <= 4 milliseconds
99.95% <= 5 milliseconds
100.00% <= 6 milliseconds
89435.71 requests per second


====== SET ======
  100150 requests completed in 1.14 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
0.31% <= 2 milliseconds
17.24% <= 3 milliseconds
91.38% <= 4 milliseconds
99.83% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
87697.02 requests per second

====== GET ======
  100073 requests completed in 1.13 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.31% <= 2 milliseconds
1.31% <= 3 milliseconds
83.78% <= 4 milliseconds
99.79% <= 5 milliseconds
100.00% <= 6 milliseconds
88560.18 requests per second


====== SET ======
  100117 requests completed in 1.12 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
0.54% <= 2 milliseconds
6.24% <= 3 milliseconds
87.60% <= 4 milliseconds
99.10% <= 5 milliseconds
99.83% <= 6 milliseconds
99.93% <= 7 milliseconds
99.97% <= 8 milliseconds
99.98% <= 9 milliseconds
99.98% <= 10 milliseconds
99.99% <= 11 milliseconds
99.99% <= 13 milliseconds
99.99% <= 15 milliseconds
99.99% <= 20 milliseconds
100.00% <= 21 milliseconds
100.00% <= 22 milliseconds
88992.89 requests per second

====== GET ======
  100092 requests completed in 1.12 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
0.35% <= 2 milliseconds
7.39% <= 3 milliseconds
91.93% <= 4 milliseconds
99.48% <= 5 milliseconds
100.00% <= 6 milliseconds
88970.66 requests per second


====== SET ======
  100048 requests completed in 1.13 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
0.54% <= 2 milliseconds
5.67% <= 3 milliseconds
84.51% <= 4 milliseconds
97.86% <= 5 milliseconds
99.02% <= 6 milliseconds
99.57% <= 7 milliseconds
99.99% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 13 milliseconds
88148.02 requests per second

====== GET ======
  100089 requests completed in 1.09 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
0.32% <= 2 milliseconds
32.44% <= 3 milliseconds
94.73% <= 4 milliseconds
99.47% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
91656.59 requests per second


====== SET ======
  100113 requests completed in 1.10 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
0.31% <= 2 milliseconds
3.63% <= 3 milliseconds
85.55% <= 4 milliseconds
99.46% <= 5 milliseconds
99.88% <= 6 milliseconds
99.98% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
90682.07 requests per second

====== GET ======
  100015 requests completed in 1.08 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
0.29% <= 2 milliseconds
1.26% <= 3 milliseconds
84.19% <= 4 milliseconds
99.01% <= 5 milliseconds
99.61% <= 6 milliseconds
99.71% <= 7 milliseconds
100.00% <= 8 milliseconds
92864.44 requests per second


====== SET ======
  100105 requests completed in 1.08 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.09% <= 1 milliseconds
1.63% <= 2 milliseconds
38.56% <= 3 milliseconds
95.78% <= 4 milliseconds
99.27% <= 5 milliseconds
99.77% <= 6 milliseconds
99.91% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
92775.72 requests per second

====== GET ======
  100029 requests completed in 1.08 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
0.34% <= 2 milliseconds
31.07% <= 3 milliseconds
97.26% <= 4 milliseconds
100.00% <= 5 milliseconds
92791.28 requests per second


====== SET ======
  100003 requests completed in 1.08 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
0.80% <= 2 milliseconds
23.91% <= 3 milliseconds
94.99% <= 4 milliseconds
99.43% <= 5 milliseconds
99.87% <= 6 milliseconds
99.95% <= 7 milliseconds
99.98% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 12 milliseconds
92595.37 requests per second

====== GET ======
  100200 requests completed in 1.09 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
0.35% <= 2 milliseconds
17.04% <= 3 milliseconds
94.94% <= 4 milliseconds
99.84% <= 5 milliseconds
100.00% <= 6 milliseconds
91590.49 requests per second


====== SET ======
  100165 requests completed in 1.10 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
1.02% <= 2 milliseconds
9.68% <= 3 milliseconds
87.92% <= 4 milliseconds
98.73% <= 5 milliseconds
99.54% <= 6 milliseconds
99.85% <= 7 milliseconds
99.94% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
91308.11 requests per second

====== GET ======
  100043 requests completed in 1.10 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
0.32% <= 2 milliseconds
4.75% <= 3 milliseconds
91.67% <= 4 milliseconds
99.77% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
90700.81 requests per second


====== SET ======
  100127 requests completed in 1.09 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.07% <= 1 milliseconds
1.14% <= 2 milliseconds
10.13% <= 3 milliseconds
87.33% <= 4 milliseconds
97.90% <= 5 milliseconds
99.30% <= 6 milliseconds
99.72% <= 7 milliseconds
99.91% <= 8 milliseconds
99.97% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 12 milliseconds
91607.50 requests per second

====== GET ======
  100012 requests completed in 1.09 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
0.30% <= 2 milliseconds
33.41% <= 3 milliseconds
96.90% <= 4 milliseconds
99.77% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 7 milliseconds
92092.09 requests per second


====== SET ======
  100013 requests completed in 1.10 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.07% <= 1 milliseconds
1.07% <= 2 milliseconds
31.14% <= 3 milliseconds
94.40% <= 4 milliseconds
99.20% <= 5 milliseconds
99.73% <= 6 milliseconds
99.91% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
91252.74 requests per second

====== GET ======
  100198 requests completed in 1.16 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
0.31% <= 2 milliseconds
16.57% <= 3 milliseconds
78.19% <= 4 milliseconds
99.54% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 7 milliseconds
86377.59 requests per second


====== SET ======
  100150 requests completed in 1.08 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
0.27% <= 2 milliseconds
1.20% <= 3 milliseconds
71.23% <= 4 milliseconds
98.91% <= 5 milliseconds
99.86% <= 6 milliseconds
99.96% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
92474.61 requests per second

====== GET ======
  100134 requests completed in 1.13 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
0.33% <= 2 milliseconds
19.26% <= 3 milliseconds
87.68% <= 4 milliseconds
99.21% <= 5 milliseconds
100.00% <= 6 milliseconds
88771.27 requests per second


====== SET ======
  100013 requests completed in 1.11 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
0.23% <= 2 milliseconds
1.08% <= 3 milliseconds
75.79% <= 4 milliseconds
98.36% <= 5 milliseconds
99.17% <= 6 milliseconds
99.58% <= 7 milliseconds
99.94% <= 8 milliseconds
100.00% <= 9 milliseconds
89939.75 requests per second

====== GET ======
  100124 requests completed in 1.08 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.28% <= 2 milliseconds
0.49% <= 3 milliseconds
72.02% <= 4 milliseconds
99.08% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 9 milliseconds
92536.04 requests per second


====== SET ======
  100063 requests completed in 1.10 seconds
  400 parallel clients
  100 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
0.74% <= 2 milliseconds
30.35% <= 3 milliseconds
95.53% <= 4 milliseconds
99.01% <= 5 milliseconds
99.67% <= 6 milliseconds
99.97% <= 7 milliseconds
99.99% <= 8 milliseconds
99.99% <= 9 milliseconds
100.00% <= 10 milliseconds
91298.36 requests per second